"use strict";

module.exports = (hexo) => {
  const isZh = hexo.theme.i18n.languages[0].search(/zh-CN/i) !== -1;
  if (isZh) {
    hexo.log.info(`
------------------------------------------------
|                                              |
|              __     ________ _____           |
|            /\\\\ \\   / /  ____|  __ \\          |
|           /  \\\\ \\_/ /| |__  | |__) |         |
|          / /\\ \\\\   / |  __| |  _  /          |
|         / ____ \\| |  | |____| | \\ \\          |
|        /_/    \\_\\_|  |______|_|  \\_\\         |
|                                              |
|    Ka1eid's SandBox - 千仞高塔, 筑基于此     |
|            基于 Ayer 主题深度定制            |
|        https://kaleidscoper.github.io        |
|                                              |
------------------------------------------------
`);
  } else {
    hexo.log.info(`
------------------------------------------------
|                                              |
|              __     ________ _____           |
|            /\\\\ \\   / /  ____|  __ \\          |
|           /  \\\\ \\_/ /| |__  | |__) |         |
|          / /\\ \\\\   / |  __| |  _  /          |
|         / ____ \\| |  | |____| | \\ \\          |
|        /_/    \\_\\_|  |______|_|  \\_\\         |
|                                              |
|       Ka1eid's SandBox - Build from Here    |
|         Customized based on Ayer theme      |
|        https://kaleidscoper.github.io        |
|                                              |
------------------------------------------------
`);
  }
};
